["He could only consider me as the living corpse of a would-be suicide, a person dead to shame, an idiot ghost.―Osamu Dazai,No Longer Human", "Rain makes me feel less alone. All rain is, is a cloud- falling apart, and pouring its shattered pieces down on top of you. It makes me feel good to know I'm not the only thing that falls apart . It makes me feel better to know other things in nature can shatter.―Lone Alaskan Gypsy", "How unhappy does one have to be before living seems worse than dying?―Deborah Curtis,Touching from a Distance: Ian Curtis and Joy Division", "Often it feels like I am breathing today only because a few years back I had no idea which nerve to cut...―Sanhita Baruah", "I used to think it utterly normal that I suffered from suicidal ideation on an almost daily basis. In other words, for as long as I can remember, the thought of ending my life came to me frequently and obsessively.―Stephen Fry", "When the black thing was at its worst, when the illicit cocktails and the ten-mile runs stopped working, I would feel numb as if dead to the world. I moved unconsciously, with heavy limbs, like a zombie from a horror film. I felt a pain so fierce and persistent deep inside me, I was tempted to take the chopping knife in the kitchen and cut the black thing out I would lie on my bed staring at the ceiling thinking about that knife and using all my limited powers of self-control to stop myself from going downstairs to get it.―Alice Jamieson,Today I'm Alice: Nine Personalities, One Tortured Mind", "Punishments include such things as flashbacks, flooding of unbearable emotions, painful body memories, flooding of memories in which the survivor perpetrated against others, self-harm, and suicide attempts.―Alison Miller,Healing the Unimaginable: Treating Ritual Abuse and Mind Control", "Oh God just look at me now... one night opens words and utters pain... I cannot begin to explain to you... this... I am not here. This is not happening. Oh wait, it is, isn't it?I am a ghost. I am not here, not really. You see skin and cuts and frailty...these are symptoms, you known, of a ghost. An unclear image with unclear thoughts whispering vague things...If I told you what was really in my head, you''d never let me leave this place. And I have no desire to spend time in hell while I'm still, in theory, alive.―Emily Andrews,The Finer Points of Becoming Machine", "What if I just want to die?\"\"Then I will be sad and disappointed that you cheated yourself out of your chance at existence. Not all of us have that opportunity, you know, to choose life.―Megan Bostic,Never Eighteen", "I think he just loved being with the bears because they didn't make him feel bad. I get it too. When he was with the bears, they didn't care that he was kind of weird, or that he'd gotten into trouble for drinking too much and using drugs(which apparently he did a lot of). They didn't ask him a bunch of stupid questions about how he felt, or why he did what he did. They just let him be who he was.―Michael Thomas Ford,Suicide Notes", "I, myself, spent 9 years in an insane asylum and never had any suicidal tendencies, but I know that every conversation I had with a psychiatrist during the morning visit made me long to hang myself because I was aware that I could not slit his throat.―Antonin Artaud", "Some people avoid thinking deeply in public, only because they are afraid of coming across as suicidal.―Mokokoma Mokhonoana", "Yes it will be a grace if I die. To exist is pain. Life is no desire of mine anymore.―Sophocles,Electra", "I will kill myself soon. But until then how do l tame my pain?―Sonali Deraniyagala,Wave", "The smiles of the unhappiest are often the widest.―Mokokoma Mokhonoana", "I've been so unhappy for years, so unhappy . . . I don't understand how a human being can be so unhappy all the time and still be alive.―Iris Murdoch,The Black Prince", "Some people are silently struggling with burdens that would break our backs.―Wayne Gerard Trotman", "I want to commit suicide but am afraid someone will think I am crazy.―Carl White", "Crisis is what suppressed pain looks like; it always comes to the surface. It shakes you into reflection and healing.―Bryant McGill,Simple Reminders: Inspiration for Living Your Best Life", "I'm sure we all have dreams of leaving at some time in our lives, but when we reach the bottom, most of us go running home.―Deborah Curtis,Touching from a Distance: Ian Curtis and Joy Division", "Anyone who dies by their own hand always has my sympathy. It's easy to sit in judgement on another's struggle from the outside without ever living in their suffocating darkness. If there is an explanation left behind, it usually confirms how relentlessly harsh and unfair they were on themselves. Mourn their release with mercy and gratitude for doing what they were capable of in their short lives.―Stewart Stafford", "But then, once you agree, it is necessary that you, the cajoler, move into the realm of self-deception, because you can see that it is costing them, you can see how much they don't want to be here, you can see that the act of existing is depleting for them, and then you have to tell yourself every day: I am doing the right thing.―Hanya Yanagihara,A Little Life", "My brain hurts and I cry all the time. I don't want to be here on Earth for one moment longer.―Ottessa Moshfegh,Homesick for Another World", "If, when I woke up in June, life still wasn't worth the trouble, I would end it. I would jump. This was the deal I made.―Ottessa Moshfegh,My Year of Rest and Relaxation", "Some things are not worth dying for, but without them life is not worth living.―Mokokoma Mokhonoana", "In suicidal people, the fear of death is replaced by realizing death is freedom.―Steven Magee", "I tell him I wish I could stay with him, but not here, not on Earth. Earth is the wrong place for me, always was and will be until the day I die.―Ottessa Moshfegh,Homesick for Another World", "I AM AT ODDS WITH MYSELF.I WILL GET EVEN WITH MYSELF.―Vineet Raj Kapoor", "How suicidal happiness can be!―Franz Kafka,The Castle", "Suicidal thoughts, you keep me company on the dark days.―Steven Magee", "He did not care what the end would be, and in his lucid moments overvalued his indifference. The danger, when not seen, has the imperfect vagueness of human thought. The fear grows shadowy; and Imagination, the enemy of men, the father of all terrors, unstimulated, sinks to rest in the dullness of exhausted emotion.―Joseph Conrad,Lord Jim", "i'm the beastrattling the cage, asking for slaughter.―Franny Choi,Soft Science", "The very same person can, at the very same time, seem at peace to some people, and depressed or even suicidal to some.―Mokokoma Mokhonoana", "I wasn't going to kill myself, but I wasn't going to stop dumb luck from taking me out either.―Shaun David Hutchinson,Brave Face", "It may be true that in any society defective types with low vitality like myself are doomed to perish, not because of what they think or anything else, but because of themselves. I have, however, some slight excuse to offer. I feel the overwhelming pressure of circumstances which make it extremely difficult for me to live.―Osamu Dazai,The Setting Sun", "How might things have been different if he spoke only one sentence? And that sentence could have been Jude, are you trying to kill yourself? or Jude, you need to tell me what’s going on, or Jude, why do you do this to yourself? Any of those would have been acceptable; any of those would have led to a larger conversation that would have been reparative, or at the very least preventative.―Hanya Yanagihara,A Little Life", "LIKE THE SUICIDAL RACCOON, I, TOO, WILL FUCK UP YOUR ALIGNMENT IF YOU RUN ME OVER. - T-shirt―Darynda Jones,Eighth Grave After Dark", "I want to quote that poem in something I'm writing,\" he explained, \"and can you tell me the last line of it ? \"Lou answered mechanically, as if he had pressed a button: \"Death is not a way out of it!\"\"A very strange theory, that about death,\" he said. \"I wonder if there's anything in it. It would really be too easy if we could get out of our troubles in so simple a fashion. It has always seemed to me that nothing can ever be destroyed. The problems of life are really put together ingeniously in order to baffle one, like a chess problem. We can't untie a real knot in a closed piece of string without the aid of the fourth dimension; but we can disentangle the complexities caused by dipping the string in water-and such things,\" he added, with an almost malicious gravity in his tone.I knew what he meant.\" It might very well be,\" he continued, \" that when we fail to solve the puzzles of life, they remain with us. We have to do them sooner or later ; and it seems reasonable to suppose that the problems of life ought to besolved during life, while we have to our hands the apparatus in which they arose. We might find that after death the problems were unaltered, but that we were impotent to deal with them. Did you ever meet any one that had been indiscreet about taking drugs ? Presumably not. Well, take my word for it, those people get into a state which is in many ways very like death. And the tragic thing about the situation is this ; that they started taking the drugs because life, in one way or another, was one too many for them. And what is the result ? The drugs have not in the least relieved the monotony of life or whatever their trouble was, and yet they have got into a state very like that of death, in which they are impotent to struggle. No, we must conquer life by living it to the full, and then we can go to meet death with a certain prestige. We can face that adventure as we've faced the others.―Aleister Crowley,Diary of a Drug Fiend", "Suicide does not mean there was no killer.―Unknown Author", "A suicide attempt is an act of fighting for one’s death.―Mokokoma Mokhonoana", "We gain the highest degree of freedom when we lose the desire to live, and gain the second highest degree when we lose the desire to live as long as we possibly can.―Mokokoma Mokhonoana", "The things that reduce the symptoms of mental illness probably are not the same things that reduce the probability of suicidal behaviors. Unfortunately we don’t know which active ingredients of suicide focused treatments enable them to reduce the probability of suicidal behaviors better than status quo treatments. We can however reasonably conclude that suicide focused treatments do a better job at reducing the probability of suicidal behaviors because they act on something other than the symptoms of mental illness.―Craig J Bryan,Rethinking Suicide: Why Prevention Fails, and How We Can Do Better", "Cassian knew that Nesta often hated herself.But he'd never known she hated herself enough to want to... not exist anymore.He'd seen her expression when he mentioned the threat of falling. And he knew going back to Velaris wouldn't save her from that look. He couldn't save her from that look, either.Only Nesta could save herself from that feeling.―Sarah J. Maas,A ​Court of Silver Flames", "Sometimes Waldemar loves me too much. He thinks it is better I stay with him on Earth, rather than be happy in the other place without him.―Ottessa Moshfegh,Homesick for Another World", "Sometimes the first insanity is the worst insanity. Sometimes it's the only one. Sometimes that's good news. Sometimes it's bad news.―Brian Spellman,Cartoonist's Book Camp", "However big the storm or challenges- Just catch the rope of HOPE, not the suicidal rope―Faithboat", "Somehow I lost all ability to regulate not only my emotions but my behavior as well.... It was an alarmingly rapid and complete descent into hell.―Marsha Linehan,Building a Life Worth Living: A Memoir", "Somewhere in my fatalism I had expected to die, accidentally, and never have the chance to walk up the stairs in the auditorium and gracefully receive my hard-earned diploma. Out of God's merciful bosom I had won reprieve.―Maya Angelou,I Know Why the Caged Bird Sings", "Suicidal tendencies are likely to increase during the COVID-19 pandemic.―Steven Magee", "Suicidal thought is a symptom of illness, of something else gone wrong. Most suicides are not impulsive, spur -of-the-moment decisions at all. Instead, most of these deaths are the result of a person losing a long and painful battle against their own impaired thinking. A suicidal person is someone who is unable to tolerate their suffering any longer. Even if she does not really want to die, she knows death will end that suffering once and for all.―Sue Klebold,A Mother's Reckoning: Living in the Aftermath of Tragedy", "Id rather die than have more. Actually I'd rather die than most things. But you know that about me. Will I ever see you again? You could come and see me here. Today I imagined you walking in, like I did when your leg. I imagined you telling them to let me go because you loved me and you'd look after me. I cried . . .―Robert Galbraith,Troubled Blood", "We didn’t find him for three days because we didn’t realize he was missing. That’s the saddest part of this story. He’d hanged himself from a tree, one of several that grew in a small sliver of land between my parents’ house and the neighbors’, out by a swing set untouched for years. He timbered over like a sapling when my father cut him down, his body gone stiff.―Samantha Hunt,The Dark Dark", "the need to survivelit a fire in me―Rupi Kaur,Home Body", "I pretended I was pausing before telling him about the secret feeling of joy I hide in my chest, waiting, waiting, waiting for someone to notice that I rise each morning, seemingly with nothing to live for, but I do rise, and it is only because of this secret joy, God's love, in my chest.―Miranda July,No One Belongs Here More Than You", "The fifties onward will be remembered as the era of the pharmaceutical industry taking control of the mental health industry and treating basic nutrient deficiencies with potent brain drugs that often make the patient sicker, psychotic or suicidal.―Steven Magee", "Dadas las circunstancias, debo asumir a la vez los papeles de demandante y demandado, de juez y parte, y encuentro toda esa farsa de la naturaleza totalmente absurda, considerando incluso humillante tener que soportarla.En consecuencia, en mi indiscutible calidad de demandante y demandado, de juez y parte, condeno a esa naturaleza, que con tanta desconsideración y rudeza me ha traído al mundo para sufrir, a perecer conmigo… desconsideración y rudeza me hatraído al mundo para sufrir, a perecer conmigo… Y como no puedo aniquilar a lanaturaleza, me aniquilo a mí mismo―Fyodor Dostoevsky,A Writer's Diary, Volume One, 1873-1876", "dadas las circunstancias, debo asumir a la vez los papeles de demandante y demandado, de juez y parte, y encuentro toda esa farsa de la naturaleza totalmente absurda, considerando incluso humillante tener que soportarla.En consecuencia, en mi indiscutible calidad de demandante y demandado, de juez y parte, condeno a esa naturaleza, que con tanta desconsideración y rudeza me ha traído al mundo para sufrir, a perecer conmigo… Y como no puedo aniquilar a la naturaleza, me aniquilo a mí mismo―Fyodor Dostoevsky,Diario de Un Escritor y Otros Escritos", "To look at yourself in the mirrorand want to dieis a feeling that can not be described to those that have never existed in suchdarkness.―Logan Duane,the things I didn't say in therapy", "To look at yourself in the mirrorand want to dieis a feeling that can not be described to thosethat have never existed in suchdarkness.―Logan Duane", "My entire life I have sought for ways to vanish from existence. Yet here I still sit, breathing myself right into it.―S.A. Quinox", "People died all the time. Why couldn't I?―Ottessa Moshfegh,Eileen", "I have nobody in the world. I'll kill myself. That's best. Everyone will say, It's for the best that she killed herself, she's better off dead . . . I hate myself so much I could spend hours and hours just screaming with hatred and with the pain of it, oh the pain of it . . .―Iris Murdoch,The Black Prince", "I was now, all the time, unutterably tired as if simply keeping alive was a terrible effort.―Iris Murdoch,A Severed Head", "Let me sleep at last. I've had misery enough in my life. You said there was nowhere to go to. There is death to go to. I've had misery enough in my life.―Iris Murdoch,The Black Prince", "I can't stand it any longer. If only I could will myself dead.―Maude Julien,The Only Girl in the World", "I have a soft spot in my heart for suicidal people. I know that others make presumptions about suicidal people, painting them with the darkest of paints; but the way that I see it, these are people who look out into the world and see how broken it is and they look into their lives and they remember all the people they've hurt and then they look into themselves and they are faced with how ruined they are and they think that if they can't make anything really better then they just shouldn't exist anymore. It's not a form of selfishness or mental illness. It's a form of extreme state of empathy and selflessness. Suicidal people really are the best kinds of people. But they need to know that this world has a place for them, that this world needs the kind of light that they carry with them as they walk through it, they need to know that they have a home. That their type of darkness is like the darkness of the universe: it's the type of darkness from whence comes forth the light! Some people are just okay with everything, they don't feel the pain and the guilt that comes with the way that this world is. And I don't think that the lack of feeling makes anybody healthier in the mind. Our world is sick. And some people know that. These are not the sick people, these are the beautiful creatures!―C. JoyBell C.", "I just want to serve and help people and be good to everybody, only it always goes wrong somehow—I think about suicide all the time, every bloody day I want to die and stop this torture, but I go crawling on . . . I'm so Christ-awful bloody lonely I could scream with it for hours on end.―Iris Murdoch,The Black Prince", "What the cold light showed me was that my situation was simply unlivable. I wanted, with a desire greater than any desire which I had ever conceived could exist without instantly killing its owner by spontaneous combustion, something which I simply could not have.―Iris Murdoch,The Black Prince", "The idea of killing himself was now more real to him than it had ever been, and he understood for the first time how it is that men can prefer extinction to the continuation of agonizing mental pain. He simply must somehow stop himself from suffering in this way. A guilt about Sophie roved sharply inside him and a cinematograph in his head re-enacted and re-enacted certain scenes. He must, he thought, now somehow switch himself off or else move on into some new and even more awful mode of being.―Iris Murdoch,The Sacred and Profane Love Machine", "She was her death now, that death which she had so much striven to emulate in life, which she had studied and practised and loved. She had succeeded, and death and she had converged into a single point. Who knew if that was victory or defeat? His last vision was of the white veil that hid her now. After all, and at last, she had become utterly private.―Iris Murdoch,The Unicorn", "It is possible to have a thousand problems and still not have a single valid reason to kill yourself.―Mokokoma Mokhonoana", "It is almost always better to take a chance and hope that your life will get better instead of ending it.―Mokokoma Mokhonoana", "But death is the ultimate blissfulnessTo be a candy or a corpseThe world holds you on its tongueAnd no one can save you―Dorothea Lasky,Rome: Poems", "The things I saw and things I missed-The many, many bloody things I fucking missed-It’s just another morning; another morning when I wish I wasn’t here.―David Peace,The Damned Utd", "Hope didn't wait to be attacked. Hope was a suicidal creature.―Angela Panayotopulos,The Wake Up", "At last he had risen to hold forth tragically about the misfortune that it was to be alive.―Sandra Newman,The Heavens", "YOU CAN NEVER DIE IN DIGNITY. KEEP LIVING.―Vineet Raj Kapoor,UNCHESS: Untie Your Shoes and Walk on the Chessboard of Life", "Extreme continuing unhappiness often consoles itself with images of death which may in a sense be idle, but which can play a vital part in consolation and also in the continuance of illusion. Ifthathappens I am dead, consoles, and also dulls the edge of speculation and even of conscience. It is another way of saying, to methatcannot happen.―Iris Murdoch,The Sacred and Profane Love Machine", "Perhaps after all not to have been born is best. How near the human soul must be to nothingness if it can be so tossed.―Iris Murdoch", "Moy thought, I shall make no more masks, something is over forever. Anyway, she thought, this time next year I shall probably be dead.―Iris Murdoch,The Green Knight", "And nowwhat will I dowith all this timethat forms my lifewith all these peoplewho care nothing for menow,that you've leftall these nightswhy, for whomand this morningfor nothing returningmy heart bangingfor whom whybanging gravely,gravely,and nowhow to face up tothat nothingnessmy life slippingo friendsbe gentleyou know wellwe have nothing to do with itAnd nowwhat will I donowthat you . . .―Alejandra Pizarnik,The Galloping Hour: French Poems", "Bradley, my marriage is over. I think my life is probably over. What a poor affair it has been.―Iris Murdoch,The Black Prince", "The easiest thing to think was that he was going to die. This was not exactly an intent to commit suicide, though he did consider suicide, it was rather a sense of the impossibility of surviving much longer, whatever he did, whatever he chose. He felt rent apart by an unremitting mental, felt as physical, strain. When he was alone he groaned aloud.―Iris Murdoch,The Sacred and Profane Love Machine", "The attack by those who want to die — this is the attack against which you cannot prepare a perfect defense.— Human aphorism―Frank Herbert,The Dosadi Experiment", "Suicide has overtaken car accidents, heart disease and cancer as the biggest killer of British men under the age of 45, and male rates of substance abuse, violence and imprisonment are eye-watering. And yet dysfunctional emotional regulation continues to be aligned with alpha masculinity.―Antonella Gambotto-Burke", "The night was very stark, alternate streams of town cars and chequered taxicabs, blaring horns busily staking claims—here is the road and here is the sidewalk. But the road looked so much livelier, what if I tried the road?―Helen Oyeyemi,Mr. Fox", "i was brought into this worldfrom a prayer, palms together,but never once did you expect meto be your biggest regret.―Sumaiya Ahmed,Reality", "it was never enough tobleed myself dry, you will never change―Sumaiya Ahmed,Reality", "A rise in suicidal tendencies is an expected outcome of a 5G irradiated world.―Steven Magee", "Suicide is often a desperate solution to the problem of not knowing where, how, and when one is going to die.―Mokokoma Mokhonoana", "Sometimes I felt I would die by wishing it when I went to sleep but I always woke up again and found I was still there. Every morning finding I'm still me, that's hell.\"\"Well, get out of hell then! The gate's open and I'm holding it!\"\"I can't. I'm hell, myself.―Iris Murdoch,The Sea, the Sea", "The circles of shame are vicious. Painful feelings of shame help cause people to be depressed and suicidal, these in turn become shameful aspects of the self. Being angry does not necessarily cause more anger, being envious does not necessarily cause more envy (though once we envy, we can also envy someone's lack of envy), but, in our culture at least, shame (and envy and self-pity) are things to be ashamed about. The two common feelings of suicide are hopelessness and powerlessness; each is shameful, and this additional experience of shame adds pain on pain. A man who despairs because he feels his prospects of having a family are hopeless also feels he will never lose the feeling of shame over being wifeless and childless. To be powerless to change one's life in ways that others can is cause to feel ashamed of one's powerlessness.―David L. Conroy,Out of the Nightmare: Recovery from Depression and Suicidal Pain", "My love is toxic and you're suicidal.―Ahmed Mostafa", "I hung back, staring at cars driving past and wondering if they were moving fast enough to knock me down.―Dodie Clark,Secrets for the Mad", "Do you have an idea of what your parents are going through?Set your world right.Parents have no idea of what you are going through.―Vineet Raj Kapoor", "I know with unqualified certainty that I want to die. But I also know with equivalent certainty that I won't do anything about it. That I will only remain here and wait for death to indulge me.―Sara Baume,A Line Made By Walking", "The suicidal lead shame-drenched lives.―David L. Conroy,Out of the Nightmare: Recovery from Depression and Suicidal Pain", "Yes you have returnedAnd things are as they wereBut this you cannot hide,A part of you has died.―Joyce Rachelle", "She didn't mind if she died trying. Suicide was in everything she did now, and everything she thought. Suicide was her home: if she could find nothing else, then suicide would always have her.―Lev Grossman,The Magician's Land", "They set about making people so unhappy and isolated and when they crawl into a hole and pull it in after them, they have the nerve to call homosexuality a 'suicidal lifestyle'. And yet they do this - and deny that any gay or trans person could ever be a 'true' Christian. As if THEY are.―Christina Engela,Blachart: Galaxii Series Book 1", "If I can’t quite figure out what an ego is, all I have to do is look for the thing that’s killing itself in the very act of feeding itself.―Craig D. Lounsbrough", "I do not know what I would do if you left me.\" For the first time I felt the suggestion of a threat in his voice—or I put it there. \"I have been alone so long—I do not think I would be able to live if I had to be alone again.―James Baldwin,Giovanni’s Room", "You have been through a lot, if you've been through my poetry―Vineet Raj Kapoor", "No hole is deep enoughto be unclimbable.Not even the one youdug yourself into.Never give up.On yourself.―Vineet Raj Kapoor", "The case of a patient with dissociative identity disorder follows:Cindy, a 24-year-old woman, was transferred to the psychiatry service to facilitate community placement. Over the years, she had received many different diagnoses, including schizophrenia, borderline personality disorder, schizoaffective disorder, and bipolar disorder. Dissociative identity disorder was her current diagnosis.Cindy had been well until 3 years before admission, when she developed depression, \"voices,\" multiple somatic complaints, periods of amnesia, and wrist cutting. Her family and friends considered her a pathological liar because she would do or say things that she would later deny. Chronic depression and recurrent suicidal behavior led to frequent hospitalizations. Cindy had trials of antipsychotics, antidepressants, mood stabilizers, and anxiolytics, all without benefit. Her condition continued to worsen.Cindy was a petite, neatly groomed woman who cooperated well with the treatment team. She reported having nine distinct alters that ranged in age from 2 to 48 years; two were masculine. Cindy’s main concern was her inability to control the switches among her alters, which made her feel out of control. She reported having been sexually abused by her father as a child and described visual hallucinations of him threatening her with a knife. We were unable to confirm the history of sexual abuse but thought it likely, based on what we knew of her chaotic early home life.Nursing staff observed several episodes in which Cindy switched to a troublesome alter. Her voice would change in inflection and tone, becoming childlike as ]oy, an 8-year-old alter, took control. Arrangements were made for individual psychotherapy and Cindy was discharged.At a follow-up 3 years later, Cindy still had many alters but was functioning better, had fewer switches, and lived independently. She continued to see a therapist weekly and hoped to one day integrate her many alters.―Donald W. Black,Introductory Textbook of Psychiatry, Fourth Edition", "Souls are flowers, only God has the right to pluck them. But those who commit suicide: their souls are the rotten blossoms of devil's garden.―Munia Khan", "To deny the battle is unwise. To believe that I can fight it without God is insane. To actually do so is suicidal. No wonder so many of us walk around looking like death warmed over.―Craig D. Lounsbrough", "But now I remember, of course, I'm never going to be old.―Sara Baume,A Line Made By Walking", "He felt life more clearly too—even, perhaps especially, when he came to decide that it wasn't worth the candle.―Julian Barnes,The Sense of an Ending", "Going with the flow of life is like catching a train at the station. You need to be at the right station at the right time and board the right train to get you where you need to be. If you go earlier than you’re supposed to, you can catch the wrong train. You don’t want to do that because it will just take you further away from me than you feel you already are. You need to go through the growing pains of grief so that you and I can fulfill our destiny and be in the right place at the right time to be reunited again.―Kate McGahan,Only Gone From Your Sight: Jack McAfghan's Little Guide to Pet Loss and Grief", "Life is the longest practical joke ever.―Mokokoma Mokhonoana", "Anyway, as you say, what the hell. I know, I've been to hell, I've seen it, I've been shown round. I'll kill myself. You'll see, you'll be sorry.―Iris Murdoch,The Green Knight", "The depressed and the suicidal are often lonely and inhibited. Discussions of inhibition in this context usually emphasize fear of rejection.―David L. Conroy,Out of the Nightmare: Recovery from Depression and Suicidal Pain", "Death could be waiting for him, but he wasn’t afraid. Whether it be sooner or later, he welcomed the inevitability with open arms.―Craig R. Key,Iniquitous", "Being in a relationship has the tendency to deceive one into believing that there is someone without whom one cannot live.―Mokokoma Mokhonoana", "An electrical utility company that blatantly lies to law enforcement about an electrical fraud researcher would be considered suicidal by many people.―Steven Magee", "In the wasteland of metro Boston, at thirteen, fourteen, his big dream had been of a gun to his own head, putting him out of his misery—a misery that by sophomore year of college was indistinguishable from everybody else's.―Garth Risk Hallberg,City on Fire", "Everything is very nearly over. And so none of the normal rules of behavior apply. And so none of my actions can have consequences.―Sara Baume,A Line Made By Walking", "Even suicidal people can smile.―Mokokoma Mokhonoana", "A walk is pleasurable the most when you walk so slowly that you seem to have piles of problems, or just piles.―Mokokoma Mokhonoana", "Waking up breaks my heart.Getting dressed breaks my arms.Joining the crowd breaks my legs.Letting someone in...does me in.―Casey Renee Kiser,Darkness Plays Favorites", "All continuous suffering, is self inflicted.―Justin K. McFarlane Beau", "The word 'survivor' carries a weight of remembrance that has broken the minds and bodies of more than a few men and women. It also contains a humbling light of recognition that compels many to do whatever they can to help reinforce the efforts of those who might be 'at risk' of not just giving up on their dreams, but of giving up on their continued existence.―Aberjhani,Illuminated Corners: Collected Essays and Articles Volume I.", "I spent most of my life believing lwas crazy because all the crazy things I experienced in childhood were treated as nonexistent or normal. This belief colored every decision made, from something so basic as what to wear today, to the more esoteric boundaries of whether I should kill myself. I understood very well that killing myself under the wrong circumstances would establish my insanity forever. So I analyzed every word, every gesture, before committing myself. (Which probably accounts for why I am alive today.)―Sarah E. Olson,Becoming One: A Story of Triumph Over Dissociative Identity Disorder", "So that's it. That's the big secret. I tried to kill myself on New Year's eve. Just like Sadie did last night. Only she really did it. I don't know all the detatils, just the basics. She took a bunch of pills. I don't know what they were or where she got them. I'd like to think they were Wonder Drug. Then at least she could have gone thinking she was flying.―Michael Thomas Ford,Suicide Notes", "Why not risk your life, if you don't want to live anyway? Why not risk your life if you'll never be happy no matter what you do?―Cassandra Clare,City of Glass", "To evade insanity and depression, we unconsciously limit the number of people toward whom we are sincerely sympathetic.―Mokokoma Mokhonoana", "There was this constant urge in me to tear my insides apart,I didn't know why. By the time I made my mind that it was impossible for meto do, there alighted the fear, haunting me with the words that rangconstantly in my head, \"You're not brave enough\".I didn't feel devastated, I felt the urge to be devastated.―Sanhita Baruah", "This book is dedicated to those who have died as a result of mind control and/or ritual abuse, and those who have lived when they would rather have died.―Alison Miller,Becoming Yourself: Overcoming Mind Control and Ritual Abuse", "With DID patients, if they feel hostility or aggression they take it out on themselves with self-harm... They’re self-destructive and repeatedly suicidal, more so than any other psychological disorder. So that's what's typical – not this wild aggression, or stalking women [or robbery].- Dr Bethany Brand, on Billy Milligan and Multiple Personality Disorder (DID)―Bethany Brand", "The music was so mournful and emotional that it seemed like the only suitable thing to play.―Deborah Curtis,Touching from a Distance: Ian Curtis and Joy Division", "Those who take their own lives, especially when the quality of those lives is much less bad than those of the cancer patient or the concentration camp prisoner, fly in the face of the normal will to live. They are seen as abnormal, not merely in the statistical sense of being unusual, but of being defective, either morally or psychologically.―David Benatar,The Metaphysics and Ethics of Death: New Essays", "That day wasn't the first time I had attempted suicide. Simply disappearing into the distant nothingness where there was no pain and no more feelings - back then I thought it an act of empowerment. Otherwise I had very little power to make any decisions about my life, my body, my actions. Taking my own life seemed my last trump card.―Natascha Kampusch,3096 Days", "COPECreate Options Pending Emergence―Kamil Ali,Profound Vers-A-Tales", "My father was a doctor,' she says, 'a very kind man. He died in the early '70s, relatively young.' She taps the cigarette packet on the table. 'Of lung cancer.''Oh.''But the thing about that is,' she says as she exhales, 'it doesn't take very long at all.―Anna Funder,Stasiland: Stories from Behind the Berlin Wall", "Although they will miss his presence if he dies, his condition is too burdensome to require his continued presence. In such circumstances, what is selfish is the insistence that the prospective suicide remain alive, not that he seek his own demise. The argument about selfishness can backfire in another way. Just as it is sometimes the case that those who kill themselves have accorded insufficient weight to the interests of others, so it is sometimes the case that those who do not kill themselves make this error. Consistent with what I have already said, I do not think that the interests of others are decisive. Nevertheless, there are situations in which a person's interest in continued life is negligible, because he will die soon anyway, and the quality of his life is appalling. If seeing out his days, rather than taking his own life earlier, would spell financial ruin for his family (because of the costs of his medical care), then it may well be unduly selfish not to take one's own life.―David Benatar,The Metaphysics and Ethics of Death: New Essays", "The only way to truly help most drug addicts and most alcoholics is to—instead of them—change reality.―Mokokoma Mokhonoana", "More people would be depressed, if parents tried to please their children as frequently and as badly as children try to please their parents.―Mokokoma Mokhonoana", "If you won't live for yourself than do it for me. If you don't want to live for me than choose something else. Anything is better than losing another person to that fake paradise that comes after death.―Arely Martinez Garcia", "It was the seventh or eighth floor, she couldn't remember which. A streetcar crawled past the front of the hotel, and people on the sidewalk moved in every direction, with legs on either side of them, and it crossed her mind to jump.―Patricia Highsmith,The Price of Salt, or Carol", "How do you defend against a person who is ready to die? How do you defend against a person who don’t fear being sent to prison for life? How do you defend against a person who has nothing to lose? It’s like trying to defend against a suicide bomber, who has no problem going out in a glorified bang.Suicide bomber, assisted death, nothing-to-lose, not afraid, fearless, criminal mindset, thug life, mental disease, suicidal, mental challenges, death march,How do you defend against a person who is ready to die? How do you defend against a person who don’t fear being sent to prison for life? How do you defend against a person who has nothing to lose? It’s like trying to defend against a suicide bomber, who has no problem going out in a glorified bang.―Drexel Deal,The Fight of My Life is Wrapped Up in My Father", "Some people’s self-esteem was secretly improved when they discovered that their then-lovers had killed themselves over them.―Mokokoma Mokhonoana", "Tilanteessa jossa henkilö on jo kiivennyt katolleja heiluttelee nyt räystään yli jalkojaan kuin krokettimailoja(puuttuu vain punainen pallo ja kalahdus, aimo annos aurinkoista mieltä)tyyneys on valttia. Haasteellisinta on hillitä vastustamaton halu kiivetähänen viereensä, levittää kädet siiviksi ja mäiskähtää katuun yhdessähänen kanssaan.―Silene Lehto,Hän lähti valaiden matkaan", "So many people want to die when all they need is to start living.―Anonymous", "Water is peaceful. I am at rest. In thewater, I am safe and pulled in where Ican’t get out. Everything slows down—the noise and the racing of my thoughts.―Jennifer Niven", "To increase the chances of a writer trying to kill themselves, cut off their hands.―Mokokoma Mokhonoana", "I do not have a problem with people killing themselves, as long as they took at least a hundred years to think about what they are about to do.―Mokokoma Mokhonoana", "Fear manifested itself as a physical presence thatseemed to dominate the public sphere. Time almost stopped. Even withoutconfirmation I could sense that something had gone terribly wrong.―Phindiwe Nkosi,Behind the Hospital", "Not everyone who has killed themselves because they were HIV positive would have been killed by AIDS.―Mokokoma Mokhonoana", "Well, that brings us to the point: There is only one way to protect ourselves from the deadly diseases that stalk the human family. It is abstinence before marriage, then marriage and mutual fidelity for life to an uninfected partner. Anything less is foolhardy and potentially suicidal. Don't let anyone tell you differently. There is no such thing as \"safe sex,\" just as there is no \"safe sin.\" For thousands of years, people have been trying to find ways to disobey the laws of God without suffering the consequences. It can't be done. Scripture tells us that the wages of sin is death, and we'd better believe it!―James C. Dobson,Life on the Edge: A Young Adult's Guide to a Meaningful Future", "When I took the pills, I wanted to kill someone I hated. I didn't know that other Veronikas existed inside me, Veronikas that I could love.―Paulo Coelho,Veronika Decides to Die", "Verily, a man without fear is either dead or happy to die.―Wayne Gerard Trotman,Veterans of the Psychic Wars", "Welcome to Final Forum. Use this board to communicate with other who are completers. Please note: Participants may not attempt to dissuade or discourage self termination. Disregard for free will informed consent will result in immediate removal from the board. Future access to Through-The-Light will be denied. This board is monitored at all times.\"That's comforting. I've been to suicide boards before where people get on and say stuff like, \"Don't do it. Suicide is not the answer.\"They don't know the question.Or, \"Life's a bitch. Get used to it.\"Thanks.\"Suicide is the easy way out.\"If it's so easy, why am I still here?And my favorite: \"God loves you. Life is the most precious gift from God. You will break God's heart if you throw His gift away.\"God has a heart? That's news to me.People on boards are very, very shallow.The Final Forum has a long list of topic, including: Random Rants, Bullied, Divorce, Disease, So Tired, Hate This Life, Bleak, Bequests, Attempts.Already I like this board.I start with Random Rants.―Julie Anne Peters,By the Time You Read This, I'll Be Dead", "During those times, they'd stand there watching me watching them. I'd pray, please. Put a pillow to my face. Clench a hand around my throat. Stab me. Shoot me. Put me out of everyone's misery.Why did you give birth to such a loser? Why didn't you admit I was hopeless and fat and stop trying to make me fit in? This world wasn't meant for me. I was born too soon or too late. Too defective.I wish I could tell my parents, \"If you want to help me, help me die.\"I wonder, Are they required to fill out a 24-hour suicide watch form? Is the Defect at home? Check. Is It alive? Check.Why did they bother with the constructive surgery on my throat anyway? Waste of money. They threw away or hid from me everything with sharp edges or breakables. Picture frames. Pottery. Did they think they could suicide-proof this place?I want to tell them, \"Chip, Kim, there is no way to suicide-proof a person―Julie Anne Peters,By the Time You Read This, I'll Be Dead", "At eighteen, she already looks like a woman of sorrows and as her breaths start becoming shorter, tired of looking over her shoulder, she only wants to get away from this city where no one can fathom her love- boundless and profane and real, like her skin and her lips and the insides of her thighs. She knows she can smile, smell like the others. Her skin would bleed too if pricked and yet this reality does not belong to the ones sleeping on the platform floor; this reality is hers and her alone. Thus when she puts the mirror back, she rummages in her handbag, searching for that thing called identity: some of it lost somewhere in the railway colony she had just left behind, some in Sudhanshu’s left jacket pocket, the rest of it scattered here around broken teacups on railings, totally aberrant and arbitrary.―Kunal  Sen"]